qwzxcv12/esp_pri/sdkconfig.defaults
# Default sdkconfig settings — Target: ESP32-S3
# ============================================================
# Target chip
CONFIG_IDF_TARGET="esp32s3"

# CPU frequency 240MHz (max for ESP32-S3)
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# System event queue & task stacks
CONFIG_ESP_SYSTEM_EVENT_QUEUE_SIZE=32
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_MAIN_TASK_STACK_SIZE=4096

# HTTP Server — allow larger headers for web pages
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=2048

# FreeRTOS tick 1000Hz (1ms resolution)
CONFIG_FREERTOS_HZ=1000

# Custom partition table (supports OTA)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y

# Flash: 4MB, QIO mode, 80MHz
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# TLS certificate bundle for HTTPS OTA
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

# ESP32-S3: Disable USB Serial/JTAG as default console
# (Use UART0 for serial monitor instead of USB CDC)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=n

# Disable PSRAM (set to y if your board has PSRAM)
CONFIG_SPIRAM=n
